#Область ДополнительныеОбработки

Функция СведенияОВнешнейОбработке() Экспорт
	
	МассивНазначений = Новый Массив;
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "Загрузка лога JUnit XML теста");
	ПараметрыРегистрации.Вставить("Версия", "29.01.2020");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация", ИнформацияПоИсторииИзменений());
	ПараметрыРегистрации.Вставить("ВерсияБСП", "1.2.1.4");
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд,
	                "Загрузка лога JUnit XML теста",
					"ЗагрузкаЛогаJUnitXMLТеста",
					"ОткрытиеФормы",
					Истина,
					);
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "",Описание = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	НоваяКоманда.Описание = Описание;
	
КонецПроцедуры

Функция ИнформацияПоИсторииИзменений()
	Возврат
	" Обработка предназначена загрузки логов в базу Тестирование 3.0 формата JUnit.
	| Работает в пользовательском режиме и по командной строке.
	|
	| Командная строка:
	| TestLogUI %ПутьФайлЛога%- путь к файлу лога (возможно использование *);
	| TestNumberUI %Номер%- номер проверки;
	| TestClientIdUI %Идентификатор%- идентификатор клиента, для поиска по списку тестируемых клиентов; 
	| TestCloseUI - закрывать форму и предприятие 1с по завершению;
	| TestDeleteLogUI - удалять лог по завершению;
	| TestCatalogDeleteUI %ПутьКаталогУдаления%- удалять каталог по завершению, если активно поле TestDeleteLogUI.
	|
	| Пример командной строки на 1С:
	| 'Путь к исполняемому файлу 1С' /S Кластер:Порт/База /NПользователь /PПароль /Execute 'Путь к обработке'  /C'TestLogUI[C:\Путь каталог\Имя файла*.xml]TestNumberUI[Номер проверки]TestConnectionStringUI[Строка cоединения ИБ]TestCloseUITestDeleteLogUI', где символы ']' и '[' не использовать";
КонецФункции

#КонецОбласти
