
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьКаталога();
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьККаталогуФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.Заголовок = "Выберите каталог"; 
	Если ЗначениеЗаполнено(Объект.ПутьКаталог) Тогда
		Диалог.Каталог = ПредставлениеПутьКаталог;
	КонецЕсли;
	Диалог.МножественныйВыбор = Ложь; 
	ВыборФайлаОткрытияСтруктурыКаталога = новый ОписаниеОповещения("ВыборФайлаОткрытияКаталога",ЭтотОбъект,Новый Структура("ИмяКаталога","ПутьКаталог"));
	Диалог.Показать(ВыборФайлаОткрытияСтруктурыКаталога);

КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаОткрытияКаталога(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		ИмяКаталога = "";
		Если ДополнительныеПараметры.Свойство("ИмяКаталога",ИмяКаталога) Тогда
			ПредставлениеПутьКаталог = ВыбранныеФайлы[0]; 
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНабораПриИзменении(Элемент)
	УстановитьВидимостьКаталога();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКаталога()
	
	Элементы.ГруппаКаталог.Видимость = (Объект.ВидНабора=ПредопределенноеЗначение("Перечисление.ВидыНаборов.ВнешнийКаталогGIT"));
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// если в гит, тогда добавим путь
	ПолучитьПредставлениеПутьКаталог();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПредставлениеПутьКаталог()
	
	Если Объект.ВидНабора=ПредопределенноеЗначение("Перечисление.ВидыНаборов.ВнешнийКаталогGIT") Тогда
		СоответствиеНастроекПользователя = СценарноеТестированиеВызовСервера.ПолучитьСоответствиеНастроекПользователя(ПользователиКлиентСервер.ТекущийПользователь(),ПользователиКлиентСервер.ТекущееРабочееМесто());
		ИмяКлюча = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.КлючиНастроек.ПутьККаталогуGIT,"ИмяКлюча");
		ПутьКаталогGIT = СоответствиеНастроекПользователя.Получить(ИмяКлюча);
		Если ПутьКаталогGIT=Неопределено ИЛИ НЕ ЗначениеЗаполнено(ПутьКаталогGIT) Тогда
			ВызватьИсключение "Не указана настройка для текущего пользователя 'ПутьКаталогGIT' или она не заполнена";
		КонецЕсли;		
		ПредставлениеПутьКаталог = ПутьКаталогGIT+"\"+Объект.ПутьКаталог;
	Иначе
		ПредставлениеПутьКаталог = Объект.ПутьКаталог;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПолучитьПредставлениеПутьКаталог();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	СформироватьПутьКаталогПоПредставлению(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура СформироватьПутьКаталогПоПредставлению(ТекущийОбъект)
	
	Если Объект.ВидНабора=ПредопределенноеЗначение("Перечисление.ВидыНаборов.ВнешнийКаталогGIT") Тогда
		СоответствиеНастроекПользователя = СценарноеТестированиеВызовСервера.ПолучитьСоответствиеНастроекПользователя(ПользователиКлиентСервер.ТекущийПользователь(),ПользователиКлиентСервер.ТекущееРабочееМесто());
		ИмяКлюча = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.КлючиНастроек.ПутьККаталогуGIT,"ИмяКлюча");
		ПутьКаталогGIT = СоответствиеНастроекПользователя.Получить(ИмяКлюча);
		Если ПутьКаталогGIT=Неопределено ИЛИ НЕ ЗначениеЗаполнено(ПутьКаталогGIT) Тогда
			ВызватьИсключение "Не указана настройка для текущего пользователя 'ПутьКаталогGIT' или она не заполнена";
		КонецЕсли;		
		ПутьКаталог = СтрЗаменить(Врег(ПредставлениеПутьКаталог),Врег(ПутьКаталогGIT),"");
		ТекущийОбъект.ПутьКаталог = Прав(ПутьКаталог,СтрДлина(ПутьКаталог)-1);
	Иначе
		ТекущийОбъект.ПутьКаталог = ПредставлениеПутьКаталог;
	КонецЕсли;
	
КонецПроцедуры