
&НаКлиенте
Процедура ВыполнитьНаКлиенте(Команда)
	PID = ЗапуститьПриложениеЛокальноКлиент(КоманднаяСтрока,Сообщение);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНаСервереНаСервере()
	Если ИспользоватьКомандуПлатформыЗапуститьПриложение=Истина Тогда
		ЗапуститьПриложение(КоманднаяСтрока,,Ложь);
	Иначе
		PID = ЗапуститьПриложениеЛокальноСервер(КоманднаяСтрока,Сообщение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНаСервере(Команда)
	ВыполнитьНаСервереНаСервере();
КонецПроцедуры


&НаСервере
Функция ЗапуститьПриложениеЛокальноСервер(Знач СтрокаЗапуска,Сообщение="")  Экспорт
	Попытка
		Шелл=Новый COMОбъект("WScript.Shell"); 
		Процесс=Шелл.Exec(СтрокаЗапуска); 
		PID=Процесс.ProcessID;
		Возврат PID;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Сообщение = ТекстОшибки;
		#Если Сервер Тогда
			ЗаписьЖурналаРегистрации("ПланировщикЗаданийКлиентСервер.ЗапуситьПриложениеЛокально",УровеньЖурналаРегистрации.Ошибка,,ТекстОшибки,,);
		#КонецЕсли
		Возврат -1;
	КонецПопытки;
КонецФункции

&НаКлиенте
Функция ЗапуститьПриложениеЛокальноКлиент(Знач СтрокаЗапуска,Сообщение="")  Экспорт
	Попытка
		Шелл=Новый COMОбъект("WScript.Shell"); 
		Процесс=Шелл.Exec(СтрокаЗапуска); 
		PID=Процесс.ProcessID;
		Возврат PID;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Сообщение = ТекстОшибки;
		#Если Сервер Тогда
			ЗаписьЖурналаРегистрации("ПланировщикЗаданийКлиентСервер.ЗапуситьПриложениеЛокально",УровеньЖурналаРегистрации.Ошибка,,ТекстОшибки,,);
		#КонецЕсли
		Возврат -1;
	КонецПопытки;
КонецФункции

&НаКлиенте
Процедура ЗакрытьПоПид(Команда)
	Computer_KillProccessByPID(".",PID);
КонецПроцедуры

Функция Computer_KillProccessByPID(Computer = ".", PID = "") Экспорт
	
	Count=0;
    
    Попытка
        
        WinMGMT = ПолучитьCOMОбъект("winmgmts:\\" + Computer + "\root\cimv2");
        Win32_Process = WinMGMT.ExecQuery("SELECT * FROM Win32_Process Where ProcessID = '" + СтрЗаменить(Строка(PID),Символы.НПП,"") + "'");
        
        Для Каждого Process ИЗ Win32_Process Цикл
            Process.Terminate();
		КонецЦикла;
		
		Count= Win32_Process.Count;
        
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		#Если Сервер Тогда
			ЗаписьЖурналаРегистрации("ПланировщикЗаданийКлиентСервер.Computer_KillProccessByPID",УровеньЖурналаРегистрации.Ошибка,,ТекстОшибки,,);
		#КонецЕсли
		Сообщить(ТекстОшибки);
    КонецПопытки;

    Возврат Count;

КонецФункции
