
Функция УстановитьЗначениеЗамераПоказателя(Знач ДатаЗамера, Знач ТестируемыйКлиент, Знач Показатель,Знач Значение, Знач ДополнительныйПоказатель=Неопределено, Знач ДополнительноеЗначение=Неопределено, Знач Проверка=Неопределено) Экспорт
	
	Попытка
		
		МенеджерЗаписи 							= РегистрыСведений.ЗамерыПоказателей.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Проверка 				= Проверка;
		МенеджерЗаписи.ТестируемыйКлиент 		= ТестируемыйКлиент;
		МенеджерЗаписи.Показатель 				= Показатель;
		МенеджерЗаписи.ДополнительныйПоказатель = ДополнительныйПоказатель;
		МенеджерЗаписи.ДатаЗамера 				= ДатаЗамера;
		МенеджерЗаписи.Значение 				= Значение;
		МенеджерЗаписи.ДополнительноеЗначение 	= ДополнительноеЗначение;
		
		МенеджерЗаписи.Записать(Истина);
	Исключение
		ЗаписьЖурналаРегистрации("ЗамерыПоказателей.УстановитьЗначениеЗамераПоказателя",УровеньЖурналаРегистрации.Ошибка,Неопределено,Неопределено,ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции
