
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПараметрыОтображения();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыОтображения(ПоказатьВспомогательные);
КонецПроцедуры

&НаКлиенте
Процедура НачатьСозданиеЗаданияПоШаблону(Команда)
	
	ДанныеОбработки = Элементы.Список.ТекущиеДанные;
	Если ДанныеОбработки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеОбработки.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ВыполняемаяКоманда = Новый Структура(
		"Ссылка, Представление, 
		|Идентификатор, ВариантЗапуска, ПоказыватьОповещение, 
		|Модификатор, ОбъектыНазначения, ЭтоОтчет, Вид");
	ЗаполнитьЗначенияСвойств(ВыполняемаяКоманда, ДанныеОбработки);
	//ВыполняемаяКоманда.ОбъектыНазначения = ОбъектыНазначения.ВыгрузитьЗначения();
	ВыполняемаяКоманда.ЭтоОтчет = Ложь;
	ВыполняемаяКоманда.Вид = ПредопределенноеЗначение("Перечисление.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка");
	
	ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьОткрытиеФормыОбработки(ВыполняемаяКоманда, ВладелецФормы, ВыполняемаяКоманда.ОбъектыНазначения);
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыОтображения(Вспомогательные=Истина)
	Список.Параметры.УстановитьЗначениеПараметра("Вспомогательные",Вспомогательные);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВспомогательныеПриИзменении(Элемент)
	УстановитьПараметрыОтображения(ПоказатьВспомогательные);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда
		HtmlОписание = СформироватьОписаниеКомандыРаздел();
		Элементы.НачатьСозданиеЗаданияПоШаблону.Доступность = Ложь;
	Иначе
		HtmlОписание = СформироватьОписаниеКоманды(ТекущиеДанные.Представление,ТекущиеДанные.Информация,ТекущиеДанные.Версия);
		Элементы.НачатьСозданиеЗаданияПоШаблону.Доступность = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьОписаниеКоманды(Знач Представление,Знач Информация,Знач Версия)
	
	html = "<html><head></head><body>";
	
	Информация = СтрЗаменить(Информация,Символы.ПС,"</br>");
	html = html +"<h3>"+Представление+"</h3>";
	html = html +"<div style='text-align:right'>Версия: "+Версия+"</div>";
	html = html + "<div>"+Информация+"</div>";
	
	html = html +"</body></html>";
	Возврат html;
	
КонецФункции

&НаСервере
Функция СформироватьОписаниеКомандыРаздел()
	
	html = "<html><head></head><body>";
	
	html = html +"</body></html>";
	Возврат html;
	
КонецФункции

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НачатьСозданиеЗаданияПоШаблону(Неопределено);
КонецПроцедуры
