
// Функция - Создать рабочее место
//
// Параметры:
//  ИмяКомпьютера	 - строка - имя компьютера/сервера
// 
// Возвращаемое значение:
//   - справочник ссылка Рабочие места
//
Функция СоздатьРабочееМесто(Знач ИмяКомпьютера,Знач ОперационнаяСистема=Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	РабочееМесто = Справочники.РабочиеМеста.ПустаяСсылка();
	
	Попытка
		РабочееМестоОбъект = Справочники.РабочиеМеста.СоздатьЭлемент();
		РабочееМестоОбъект.Наименование = ИмяКомпьютера;
		РабочееМестоОбъект.ИмяКомпьютера = ИмяКомпьютера;
		РабочееМестоОбъект.ОперационнаяСистема = ОперационнаяСистема;
		РабочееМестоОбъект.Записать();
		РабочееМесто = РабочееМестоОбъект.Ссылка;
	Исключение
		ЗаписьЖурналаРегистрации("Создание рабочего места",УровеньЖурналаРегистрации.Ошибка,Метаданные.Справочники.РабочиеМеста,Неопределено,ОписаниеОшибки());
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат РабочееМесто;
КонецФункции
