#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа=Ложь Тогда
		Автор = ПользователиКлиентСервер.ТекущийПользователь();
		ДатаСоздания = ТекущаяДата();
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("СправочникСсылка.ПланыТестирования") Тогда
		ПланТестирования = ДанныеЗаполнения;
		// Формирование описания
		Описание = "Шаги/Действия "+Символы.ПС;
		Для каждого стр из ДанныеЗаполнения.ШагиДействия Цикл
			Описание = Описание+стр.НомерСтроки+") "+стр.Описание+Символы.ПС;
		КонецЦикла;
		Описание = Описание+"Ожидаемые результаты "+Символы.ПС;
		Для каждого стр из ДанныеЗаполнения.ОжидаемыеРезультаты Цикл
			Описание = Описание+стр.НомерСтроки+") "+стр.Описание+Символы.ПС;
		КонецЦикла;
		Проект = ДанныеЗаполнения.Проект;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовыйОбъект = ЭтоНовый();
	
	ДополнительныеСвойства.Вставить("ЭтоНовыйОбъект", ЭтоНовыйОбъект);
	
	Если ЭтоНовыйОбъект И НЕ ЗначениеЗаполнено(ДатаСоздания) И НЕ ЭтоГруппа Тогда
		ДатаСоздания = ТекущаяДата();
		//Автор        = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ID = "";
КонецПроцедуры

#КонецОбласти

#КонецЕсли