
#Область РаботаСПараметрами

// Процедура - Создать/обновить параметр
//  Создает или обновляет настройку парамтера. Для служебных параметров, которые предназначены только для определения использования в редакторе, 
//  используйте опцию (ЭтоПараметрНастройки=Истина)
Процедура УстановитьПараметр(Знач Владелец, Знач ИмяПеременной, Знач ЗначениеПеременной, Знач ЭтоПараметрНастройки=Истина, ОписаниеСвойств=Неопределено ) Экспорт
	КонструкторЗаданийСервер.УстановитьПараметр(Владелец,ИмяПеременной,ЗначениеПеременной,ОписаниеСвойств);
КонецПроцедуры	

// Возвращает значение переменной
Функция  ПолучитьЗначениеПараметра(Знач Владелец, Знач ИмяПеременной, Знач ЭтоПараметрНастройки=Истина, Знач Ключ=Неопределено)
	Возврат КонструкторЗаданийСервер.ПолучитьЗначениеПараметра(Владелец,ИмяПеременной,ЭтоПараметрНастройки,Ключ);	
КонецФункции

#КонецОбласти

#Область РаботаСШаблонами

// Создаем шаблон команды
Функция СоздатьШаблонКоманды(Знач ИдентификаторКонструктора, Знач Наименование, Знач КлючПоиска, Знач ТекстШаблона)
	Возврат КонструкторЗаданийСервер.СоздатьШаблонКоманды(ИдентификаторКонструктора,Наименование,КлючПоиска,ТекстШаблона);
КонецФункции

#КонецОбласти


#Область РаботаСДействиями
	
// Создаем действие задания
Функция СоздатьДействиеЗадания(Знач ИдентификаторКонструктора, Знач СвойстваЗадания) Экспорт
	Возврат КонструкторЗаданийСервер.СоздатьДействиеЗадания(ИдентификаторКонструктора,СвойстваЗадания);
КонецФункции

#КонецОбласти


#Область РаботаССоставомЗаданий

// Очищаем полностью состав заданий
Процедура ОчиститьСоставЗаданий(Знач Задание) Экспорт
	КонструкторЗаданийСервер.ОчиститьСоставЗаданий(Задание);
КонецПроцедуры

// добавить действие в состав заданий
Процедура ДобавитьВСоставЗаданий(Знач Задание, Знач Действие, Знач ПорядокВыполнения, Знач ПодчиненноеЗадание=Неопределено) Экспорт
	КонструкторЗаданийСервер.ДобавитьВСоставЗаданий(Задание,Действие,ПорядокВыполнения,ПодчиненноеЗадание);
КонецПроцедуры
	
#КонецОбласти

#Область РаботаСЗаданиями

Функция СоздатьОбновитьЗадание(Знач Задание, Знач СвойстваЗадания) Экспорт
	Возврат КонструкторЗаданийСервер.СоздатьОбновитьЗадание(Задание,СвойстваЗадания);
КонецФункции

Функция НайтиЗаданиеПоID(Знач ID,Знач Задание=Неопределено) Экспорт
	Возврат КонструкторЗаданийСервер.НайтиЗаданиеПоID(ID,Задание);
КонецФункции
#КонецОбласти