#Область НачалоСтандарт

Функция ПолучитьСоответствиеНастроекПользователя(Знач Пользователь, Знач ТекущееРабочееМесто) Экспорт
	
	Возврат СценарноеТестированиеСервер.ПолучитьСоответствиеНастроекПользователя(Пользователь, ТекущееРабочееМесто);
	
КонецФункции

Функция ПолучитьПутьКФайлуСценария(Знач Тест, Знач ПутьКВременномуКаталогуФайлов="", Знач ПутьКаталогGIT="") Экспорт
	
	Возврат СценарноеТестированиеСервер.ПолучитьПутьКФайлуСценария(Тест,ПутьКВременномуКаталогуФайлов,ПутьКаталогGIT);
	
КонецФункции 

Функция ОбработатьСтрокуПоПараметрам(Знач ИсходнаяСтрока, Знач СтруктураПараметров)   Экспорт
	
	Возврат СценарноеТестированиеСервер.ОбработатьСтрокуПоПараметрам(ИсходнаяСтрока, СтруктураПараметров);
	
КонецФункции


Процедура УстановитьСинонимТеста(Знач Тест, Знач Синоним) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СинонимыТестов.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Тест = Тест;
	МенеджерЗаписи.Синоним = Синоним;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры


Функция ПолучитьСинонимТеста(Знач Тест) Экспорт
	
	Синоним = Неопределено;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СинонимыТестов.Тест КАК Тест,
	|	СинонимыТестов.Синоним КАК Синоним
	|ИЗ
	|	РегистрСведений.СинонимыТестов КАК СинонимыТестов
	|ГДЕ
	|	СинонимыТестов.Тест = &Тест";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Синоним;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Синоним;
	
КонецФункции
#КонецОбласти

#Область РаботаПараметрыПользователя


// Получает данные праметров сценария по входному ключу, при
// указании ИмяениПарамтера будет установлен дополнительный фильтр
// 
// Параметры:
// 	Ключ - ключ для поиска данных
// 	ИмяПараметра - Неопределено - массив параметров строкой через запятую
// Возвращаемое значение:
// 	Массив - Описание
Функция ПолучитьДанныеПараметровСценариевПоКлючу(Знач Ключ,Знач ИмяПараметра=Неопределено) Экспорт
	Возврат СценарноеТестированиеСервер.ПолучитьДанныеПараметровСценариевПоКлючу(Ключ,ИмяПараметра);
КонецФункции	


// Возвращает параметры подключения к тестируемому клиенту
// 
// Параметры:
// 	Ключ - ключ для поиска данных
// 	ИмяПараметра - Неопределено - Описание
// Возвращаемое значение:
// 	Неопределено, Структура - Описание:
// * ИмяПараметра - Строка -
// * НомерПорта - Строка -
// * Пароль1С - Строка -
// * Пользователь1С - Строка -
// * СтрокаПодключения - Строка -
// * ДополнительныеОпцииЗапуска - Строка -
// * ЭтоФайловаяБаза - Булево -
// * ЭтоНеПредприятие1С - Булево -
// * БазаНеУказана - Булево -
// * ПользовательНеУказан - Булево -
Функция ПолучитьДанныеПодключенияПользователяПоКлючу(Знач Ключ,Знач ИмяПараметра=Неопределено) Экспорт
	Возврат СценарноеТестированиеСервер.ПолучитьДанныеПодключенияПользователяПоКлючу(Ключ,ИмяПараметра);
КонецФункции	

#КонецОбласти