
Процедура УстановитьЗаголовок() Экспорт
	
	ТекущийЗаголовок = ПолучитьЗаголовокКлиентскогоПриложения();
	Пользователь = Строка(ПользователиКлиентСервер.ТекущийПользователь());
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = "Не указан";		
	КонецЕсли;
	Заголовок = СлужебныйВызовСервереПовтИсп.ПолучитьЗаголовокСистемы();
	НовыйЗаголовок = Заголовок+"/"+Пользователь+"/"+ТекущийЗаголовок;
	УстановитьЗаголовокКлиентскогоПриложения(НовыйЗаголовок);
	
КонецПроцедуры

Процедура УстановитьИмяКомпьютера(ИмяКомпьютера) Экспорт
	
	СлужебныйСерверВызовСервера.УстановитьИмяКомпьютера(ИмяКомпьютера);
	
КонецПроцедуры

Функция СоздатьНовоеРабочееМесто() Экспорт
	
	//Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	//ИмяКомпьютера = "";
	//ОперационнаяСистема = Неопределено;
	//КаталогПоУмолчанию = КаталогВременныхФайлов();
	//СлужебныйСервер.СоздатьНовоеРабочееМесто(ИмяКомпьютера,ОперационнаяСистема,КаталогПоУмолчанию,Пользователь);
	
КонецФункции