#Область ДополнительныеОбработки

Функция СведенияОВнешнейОбработке() Экспорт
	
	МассивНазначений = Новый Массив;
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "Менеджер выполнения чек-лист тестов");
	ПараметрыРегистрации.Вставить("Версия", "2018.01.01");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация", ИнформацияПоИсторииИзменений());
	ПараметрыРегистрации.Вставить("ВерсияБСП", "1.2.1.4");
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд,
	                "Менеджер выполнения чек-лист тестов",
					"МенеджерВыполненияЧекЛистТестов",
					"ОткрытиеФормы",
					Истина,
					);
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "",Описание = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	НоваяКоманда.Описание = Описание;
	
КонецПроцедуры

Функция ИнформацияПоИсторииИзменений()
	Возврат
	" 
	|  <div style='text-indent: 25px;'>Обработка предназначена для выполнения и внесения тестов вручную (чек-лист).</div> 
	|  <div style='text-indent: 25px;'>Для теста обязательно наличие плана тестирования. Из справочника плана тестов подтягивается список тестовых случаев и шагов. В процессе работы пользователь должен выбрать тест (чек-лист), указать тестируемого клиента и создать/выбрать проверку. </div>
	|
	|  <div style='text-indent: 25px;'>Работает в составе конфигурации 'Тестирование 3.0'.</div>
	|
	| <hr />
	| Подробную информацию смотрите по адресу интернет: <a target='_blank' href='https://github.com/ivanov660/TestingTool-3/wiki/Менеджер-выполнения-чек-лист-тестов'>https://github.com/ivanov660/TestingTool-3/wiki/Менеджер-выполнения-чек-лист-тестов</a>";

КонецФункции

#КонецОбласти
