#Область ДополнительныеОбработки

Функция СведенияОВнешнейОбработке() Экспорт
	
	МассивНазначений = Новый Массив;
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "Тест = начальные данные + UI + удаление данных");
	ПараметрыРегистрации.Вставить("Версия", "08.09.2017");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация", ИнформацияПоИсторииИзменений());
	ПараметрыРегистрации.Вставить("ВерсияБСП", "1.2.1.4");
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд,
	                "Тест = начальные данные + UI + удаление данных",
					"ShortUITaskTestBuilder",
					"ОткрытиеФормы",
					Истина,
					);
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Функция ИнформацияПоИсторииИзменений()
	Возврат "
	| <div style='text-indent: 25px;'>Данная обработка позволяет создавать задания для запуска сценарных тестов использующих данные загруженные предварительно.</div>
	| <div style='text-indent: 25px;'>Порядок выполнения:
	| <li>на первом шаге запускается обработка для загрузки начальных данных</li>
	| <li>далее выполняется сценарный тест</li>
	| <li>заключительно выполняется обработка, которая удаляет начальные данные и данные созданные сценарным тестом</li>
	| </div>
	| <div style='text-indent: 25px;'>Требования:
	| <li> Наличие сценарного теста в базе. </li> 
	| <li> Наличие юнит-тестов создания начальных данных и удаления данных после теста в базе. </li>
	| <li> Использует обработку '<i>Менеджер сценарного теста</i>' (<i>МенеджерСценарногоТеста.epf</i>), обработка должна быть расположена в корне каталога GIT.</li>
	| <li> Использует обработку Фреймворка '<i>xUnitFor1C</i>' (<i>xddTestRunner.epf</i>), обработка должна быть расположена в корне каталога GIT.</li>
	| <li> В пользовательских настройках должны быть указаны пути к каталогу GIT, каталогу отчетов, каталогу библиотеки готовых шагов, каталогу выполнения сценарных тестов.</li> </div>
	| <hr />
	| Подробную информацию смотрите по адресу интернет: <a target='_blank' href='https://github.com/ivanov660/TestingTool-3/wiki'>https://github.com/ivanov660/TestingTool-3/wiki</a>";

КонецФункции

#КонецОбласти
