
#Область РаботаОбщегоЧата

Функция ЗарегистрироватьсяВОбщийЧат1С(Знач Логин, Знач Порт, Знач ТочкаВхода,Знач ИдентификаторУчастника="",Знач PID=0,Знач ИспользоватьСуществуюущего=Ложь) Экспорт

	Возврат ОбщийЧатСервер.ЗарегистрироватьсяВОбщийЧат1С(Логин,Порт,ТочкаВхода,ИдентификаторУчастника,PID,ИспользоватьСуществуюущего);
	
КонецФункции

Процедура ОбновитьИнформациюСтатусУчастникаЧата(СтруктураЗаписи,Режим="обновить") Экспорт
	ОбщийЧатСервер.ОбновитьИнформациюСтатусУчастникаЧата(СтруктураЗаписи,Режим);
КонецПроцедуры

Функция ПолучитьТаблицуУчастниковЧата() Экспорт
	Возврат ОбщийЧатСервер.ПолучитьТаблицуУчастниковЧата();
КонецФункции

Процедура ОбновитьДатуАктивностиСтатусаУчастника(Знач ИдентификаторУчастника) Экспорт
	ОбщийЧатСервер.ОбновитьДатуАктивностиСтатусаУчастника(ИдентификаторУчастника);
КонецПроцедуры

Функция  ПолучитьСтатусУчатникаПоИдентиикатору(Знач ИдентификаторУчастника) Экспорт
	Возврат ОбщийЧатСервер.ПолучитьСтатусУчатникаПоИдентиикатору(ИдентификаторУчастника);
КонецФункции	

Функция  ПолучитьСтатусУчатникаПоИмениУчастника(Знач Участник) Экспорт
	Возврат ОбщийЧатСервер.ПолучитьСтатусУчатникаПоИмениУчастника(Участник);
КонецФункции

Процедура ОбновитьСоздатьУчастникаЧата(СтруктураЗаписи,Режим="обновить") Экспорт
	ОбщийЧатСервер.ОбновитьСоздатьУчастникаЧата(СтруктураЗаписи,Режим);
КонецПроцедуры	

Функция ПолучитьСостоянияУчастников(Знач ПараметрыУчастников) Экспорт
	Возврат ОбщийЧатСервер.ПолучитьСостоянияУчастников(ПараметрыУчастников);
КонецФункции

#КонецОбласти

#Область Сообщения

Процедура ОтправитьСообщениеВЧат(СтруктураСообщения) Экспорт
	ОбщийЧатСервер.ОтправитьСообщениеВЧат(СтруктураСообщения);	
КонецПроцедуры

Функция ПолучитьНовыеСообщения(Знач ИдентификаторУчастника)  Экспорт
	Возврат ОбщийЧатСервер.ПолучитьНовыеСообщения(ИдентификаторУчастника);
КонецФункции

Функция ПолучитьСообщенияЧата(Знач ИдентификаторКомнаты,Знач ИдентификаторОтправителя,Знач ИдентификаторПолучателя,Знач ГлубинаЧата=24,Знач ГлубинаЧатаСообщений=42) Экспорт
	Возврат ОбщийЧатСервер.ПолучитьСообщенияЧата(ИдентификаторКомнаты,ИдентификаторОтправителя,ИдентификаторПолучателя,ГлубинаЧата,ГлубинаЧатаСообщений);
КонецФункции

#КонецОбласти


#Область Комнаты

Функция ЗайтиВИгровуюКомнату(Знач ИдентификаторУчастника,Знач ИгроваяКомната) Экспорт
	Возврат ОбщийЧатСервер.ЗайтиВИгровуюКомнату(ИдентификаторУчастника,ИгроваяКомната);
КонецФункции

Функция ВыйтиИзИгровойКомнаты(Знач ИдентификаторУчастника,Знач ИгроваяКомната) Экспорт
	Возврат ОбщийЧатСервер.ВыйтиИзИгровойКомнаты(ИдентификаторУчастника,ИгроваяКомната);
КонецФункции

Функция ВыйтиИзВсехИгровыхКомнат(Знач ИдентификаторУчастника) Экспорт
	Возврат ОбщийЧатСервер.ВыйтиИзВсехИгровыхКомнат(ИдентификаторУчастника);
КонецФункции

#КонецОбласти
