
&НаКлиенте
Процедура ЗавершитьПроцесс(Команда)
	
	
	Если Элементы.СписокПроцессов.ВыделенныеСтроки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	Компьютер = Объект.Компьютер;
	Если НЕ ЗначениеЗаполнено(Компьютер) Тогда
		Компьютер = ".";
	КонецЕсли;
	
	Для каждого стр из Элементы.СписокПроцессов.ВыделенныеСтроки Цикл
		
		ТекущиеДанные = Объект.СписокПроцессов.НайтиПоИдентификатору(стр);
		
		Если ПланировщикЗаданийКлиентСервер.Computer_KillProccessByPID(Компьютер,ТекущиеДанные.ProcessId)<>0 Тогда
			Сообщить("Ошибка. "+ТекущиеДанные.Caption+" "+ТекущиеДанные.ProcessId);			
		Иначе
			Сообщить("Успешно. "+ТекущиеДанные.Caption+" "+ТекущиеДанные.ProcessId);			
		КонецЕсли;
		
		
	КонецЦикла;
	
	ЗаполнитьСписокПроцессов();
	
	Возврат;
	
	//ТекущиеДанные = Элементы.СписокПроцессов.ТекущиеДанные;
	//Если ТекущиеДанные=Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Компьютер = Объект.Компьютер;
	//Если НЕ ЗначениеЗаполнено(Компьютер) Тогда
	//	Компьютер = ".";
	//КонецЕсли;
	//
	//Если ПланировщикЗаданийКлиентСервер.Computer_KillProccessByPID(Компьютер,ТекущиеДанные.ProcessId)<>0 Тогда
	//	Сообщить("Ошибка");
	//	ЗаполнитьСписокПроцессов();
	//Иначе
	//	Сообщить("Успешно");
	//	ЗаполнитьСписокПроцессов();
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьСписокПроцессов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСписокПроцессов();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокПроцессов()
	
	Перем МассивПроцессов, стр, стр_н;
	
	Компьютер = Объект.Компьютер;
	Если НЕ ЗначениеЗаполнено(Компьютер) Тогда
		Компьютер = ".";
	КонецЕсли;
	
	МассивПроцессов = ПланировщикЗаданийКлиентСервер.Computer_SystemProcess(Компьютер);
	Объект.СписокПроцессов.Очистить();
	Для каждого стр из МассивПроцессов Цикл
		стр_н = Объект.СписокПроцессов.Добавить();
		ЗаполнитьЗначенияСвойств(стр_н,стр);
	КонецЦикла;
	
КонецПроцедуры

