#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ, Замещение)
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	// сформируем данные в млс
	Для каждого стр из ЭтотОбъект Цикл
		стр.ИнтервалСек = ПланировщикЗаданийКлиентСервер.ПреобразоватьДатуВСек(стр.Интервал);
		стр.ВремяНачалаСек = ПланировщикЗаданийКлиентСервер.ПреобразоватьДатуВСек(стр.ВремяНачала);
		стр.ВремяОкончанияСек = ПланировщикЗаданийКлиентСервер.ПреобразоватьДатуВСек(стр.ВремяОкончания);
		стр.ДатаЗапускаСек = ПланировщикЗаданийКлиентСервер.ПреобразоватьДатуВСек(стр.ДатаЗапуска);
		стр.ДатаЗавершенияСек = ПланировщикЗаданийКлиентСервер.ПреобразоватьДатуВСек(стр.ДатаЗавершения);
	КонецЦикла;	

КонецПроцедуры

#КонецЕсли