
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИзменитьВидимостьРасширения();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
КонецПроцедуры

&НаКлиенте
Процедура ТипНастройкиПриИзменении(Элемент)
	ИзменитьВидимостьРасширения();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидимостьРасширения()
	
	Элементы.Расширение.Видимость = (Объект.ТипНастройки=ПредопределенноеЗначение("Перечисление.ТипыКлючейНастроек.Файл"));
	
КонецПроцедуры