
Процедура СброситьНастройкиНачальнойСтраницыПриВыбранномОсновномРабочемМесте() Экспорт
	
	Если СбрасыватьНастройкиПользователя() Тогда
		НастройкиНачальнойСтраницы = новый НастройкиНачальнойСтраницы;
		СоставФорм = новый СоставФормНачальнойСтраницы;
		
		НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы",,НастройкиНачальнойСтраницы);
	КонецЕсли;
	
КонецПроцедуры

Функция УстановленоОсновноеРабочееМесто() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкаРабочегоМестаНачальнойСтранцы.Пользователь,
	|	НастройкаРабочегоМестаНачальнойСтранцы.ДополнительнаяОбработкаДляРабочегоМеста
	|ИЗ
	|	РегистрСведений.НастройкаРабочегоМестаНачальнойСтранцы КАК НастройкаРабочегоМестаНачальнойСтранцы
	|ГДЕ
	|	НастройкаРабочегоМестаНачальнойСтранцы.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь",Пользователи.ТекущийПользователь());
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция ОткрыватьОсновноеРабочееМестоПриЗапускеСистемы() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкаРабочегоМестаНачальнойСтранцы.Пользователь,
	|	НастройкаРабочегоМестаНачальнойСтранцы.ДополнительнаяОбработкаДляРабочегоМеста
	|ИЗ
	|	РегистрСведений.НастройкаРабочегоМестаНачальнойСтранцы КАК НастройкаРабочегоМестаНачальнойСтранцы
	|ГДЕ
	|	НастройкаРабочегоМестаНачальнойСтранцы.Пользователь = &Пользователь
	|	И НастройкаРабочегоМестаНачальнойСтранцы.НеОткрыватьРабочееМестоПриСтарте = ЛОЖЬ";
	Запрос.УстановитьПараметр("Пользователь",Пользователи.ТекущийПользователь());
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция СбрасыватьНастройкиПользователя() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкаРабочегоМестаНачальнойСтранцы.Пользователь,
	|	НастройкаРабочегоМестаНачальнойСтранцы.ДополнительнаяОбработкаДляРабочегоМеста
	|ИЗ
	|	РегистрСведений.НастройкаРабочегоМестаНачальнойСтранцы КАК НастройкаРабочегоМестаНачальнойСтранцы
	|ГДЕ
	|	НастройкаРабочегоМестаНачальнойСтранцы.Пользователь = &Пользователь
	|	И НастройкаРабочегоМестаНачальнойСтранцы.НеСбрасыватьНастройкиНачальнойСтраницы = ЛОЖЬ";
	Запрос.УстановитьПараметр("Пользователь",Пользователи.ТекущийПользователь());
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции