
Функция НайтиПоказательПоID(Знач ID) Экспорт
	
	Показатель = Справочники.Показатели.ПустаяСсылка();
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Показатели.Ссылка
	|ИЗ
	|	Справочник.Показатели КАК Показатели
	|ГДЕ
	|	Показатели.ID = &ID";
	Запрос.УстановитьПараметр("ID",ID);

	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Показатель = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Показатель;
	
КонецФункции