&НаКлиенте
Перем Модуль_СервисныеФункции;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отказ = Истина; // форма не предназначена для открытия
КонецПроцедуры


#Область ЗаписьЖурналаДействий1С

#КонецОбласти

#Область ЗаписьЖурналаДействийAutoamtionUI

&НаКлиенте
Процедура НачатьЗапись_AutomationUI_API(Знач PID=0) Экспорт
	
	ЗагрузитьБиблиотеки();	
	
	СтруктураОтвета = Неопределено;

	// 1. Определеим запущен ли веб сервер
	СтруктураОтвета = Модуль_СервисныеФункции.ЗагрузитьФайлПоИнтернетАдресу("http://localhost:8080/rest.html");
	// 2. Если не запущен попробуем запустить, и проверим еще раз
	Если НЕ СтруктураОтвета.КодСостояния=200 Тогда
		ВызватьИсключение "Не запущена служба";
	КонецЕсли;
	// 3. Отправляем команду начала записи 
	СтруктураОтвета = Модуль_СервисныеФункции.ЗагрузитьФайлПоИнтернетАдресу("http://localhost:8080/rest.html?&Operation=record_run"+?(PID<>0,"&process_id="+Формат(PID,"ЧГ=;"),""));
	Если НЕ СтруктураОтвета.КодСостояния=200 Тогда
		ВызватьИсключение "Не удалось запустить запись";
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПаузаЗапись_AutomationUI_API() Экспорт
	
	ЗагрузитьБиблиотеки();
	
	СтруктураОтвета = Модуль_СервисныеФункции.ЗагрузитьФайлПоИнтернетАдресу("http://localhost:8080/rest.html?&Operation=record_pause");
	
	Если НЕ СтруктураОтвета.КодСостояния=200 Тогда
		ВызватьИсключение "Не удалось нажать паузу";
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ЗавершитьЗапись_AutomationUI_API() Экспорт
	
	ЗагрузитьБиблиотеки();
	
	Текст = "";
	
	СтруктураОтвета = Модуль_СервисныеФункции.ЗагрузитьФайлПоИнтернетАдресу("http://localhost:8080/rest.html?&Operation=record_stop");
	
	Если НЕ СтруктураОтвета.КодСостояния=200 Тогда
		ВызватьИсключение "Не удалось завершить запись";
	КонецЕсли;
	
	ТекстовыйДокумент = новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(СтруктураОтвета.ПутьКФайлу,"UTF-8");
	Текст = ТекстовыйДокумент.ПолучитьТекст();
		
	Возврат Текст;
КонецФункции


&НаКлиенте
Функция СписокПриложенийДляОтладки_AutomationUI_API() Экспорт
	
	ЗагрузитьБиблиотеки();
	
	СтруктураОтвета = Неопределено;

	СтруктураОтвета = Модуль_СервисныеФункции.ЗагрузитьФайлПоИнтернетАдресу("http://localhost:8080/rest.html?&Operation=app_list");

	Если НЕ СтруктураОтвета.КодСостояния=200 Тогда
		ВызватьИсключение "Не удалось получить данные";
	КонецЕсли;
	
	ТекстовыйДокумент = новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(СтруктураОтвета.ПутьКФайлу,"UTF-8");
	Текст = ТекстовыйДокумент.ПолучитьТекст();
	
	Результат = Модуль_СервисныеФункции.ОбработкаJSON(Текст);
		
	Возврат Результат;
КонецФункции
	

#КонецОбласти

#Область ЗаписьЖурналаДействийSelenuim

#КонецОбласти

&НаКлиенте
Процедура ЗагрузитьБиблиотеки()
	
	Если Модуль_СервисныеФункции=Неопределено Тогда
		Модуль_СервисныеФункции = ПолучитьФорму("ВнешняяОбработка.МенеджерСценарногоТеста.Форма.Модуль_СервисныеФункции");
	КонецЕсли;		
	
КонецПроцедуры	
