#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ЕстьНаличиеДубляНаименования(Знач Наименование,Знач Ссылка,ТекстОшибки="")  Экспорт
		
	Результат = Ложь;
	
	// потом исправить
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИменаПеременных.Ссылка
	|ИЗ
	|	Справочник.ИменаПеременных КАК ИменаПеременных
	|ГДЕ
	|	ИменаПеременных.Наименование = &Наименование
	|	И ИменаПеременных.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Наименование",Наименование);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Результат = Истина;
		Выборка = РезультатЗапроса.Выбрать();
		ТекстОшибки = "Существуют уже элементы справочника с наименованием '"+Наименование+"' ";
		Пока Выборка.Следующий() Цикл
			ТекстОшибки = ТекстОшибки  + Символы.ПС + " Существующий элемент справочника UID("+Строка(Выборка.Ссылка.UUID())+")";
		КонецЦикла;
		
	КонецЕсли;
		
	Возврат Результат;
КонецФункции
		
#КонецЕсли		