
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбработатьОтборФильтра(ОтборПоТипамТеста);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоТипамТестаПриИзменении(Элемент)
	ОбработатьОтборФильтра(ОтборПоТипамТеста);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтборФильтра(Знач ТипОтбора)
	
	ЭлементОтбора = Неопределено;  	
	
	Для каждого стр из Список.Отбор.Элементы Цикл
		Если стр.ИдентификаторПользовательскойНастройки="ОтборПоТипамТеста" Тогда
			ЭлементОтбора = стр;
			прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементОтбора=Неопределено Тогда 
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));  	
		ЭлементОтбора.ИдентификаторПользовательскойНастройки = "ОтборПоТипамТеста";
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипТеста");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
	Если ТипОтбора=ПредопределенноеЗначение("Перечисление.ТипыТестов.ПустаяСсылка") Тогда
		ЭлементОтбора.Использование = Ложь;
	Иначе
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
	ЭлементОтбора.ПравоеЗначение = ТипОтбора;
	
	
КонецПроцедуры
