
Процедура ПередЗаписью(Отказ, Замещение)
	// сформируем данные в млс
	Для каждого стр из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(стр.ДатаВыполненияСек) Тогда
			стр.ДатаВыполненияСек = ПланировщикЗаданийКлиентСервер.ПреобразоватьДатуВСек(стр.ДатаВыполнения);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(стр.ВремяНачалаСек) Тогда
			стр.ВремяНачалаСек = ПланировщикЗаданийКлиентСервер.ПреобразоватьДатуВСек(стр.ВремяНачала);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(стр.ИнтервалСек) Тогда
			стр.ИнтервалСек = ПланировщикЗаданийКлиентСервер.ПреобразоватьДатуВСек(стр.Интервал);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	// Вставить содержимое обработчика.
КонецПроцедуры
