&НаКлиенте
Перем Модуль_СервисныеФункции;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отказ = Истина; // форма не предназначена для открытия
КонецПроцедуры


&НаКлиенте
Процедура мСценСкрипт_ОбработатьОперациюРаботыПамяти(ОписаниеОшибки,мПараметрыКлиент,мПараметры) Экспорт
	
	ИмяКоманды = нрег(мПараметры.ИмяКоманды);
	ИмяПараметра = мПараметры.ИмяПараметра;
	mKey = мПараметры.Key;
	Type = мПараметры.Type;
	FileName = мПараметры.FileName;
	СтруктураДанных = Неопределено;
	ПараметрыСценария = мПараметры.ПараметрыСценария;
	
	ПутьКФайлу = "";
	Если Type="TemporaryJSON" Тогда
		Файл = новый Файл(ПолучитьИмяВременногоФайла(".txt"));
		ПутьКФайлу = Файл.Путь + FileName + ?(Найти(ПутьКФайлу,"."),"",".txt");
	ИначеЕсли Type="CatalogJSON" Тогда
		ПутьКФайлу = FileName + ?(Найти(ПутьКФайлу,"."),"",".txt");;
	КонецЕсли;
	
	Если ИмяКоманды="запомнить" Тогда
		
		СтруктураДанных = новый Структура;
		МассивДанных = СтрРазделить(ИмяПараметра,",;:/\",Ложь);
		Для каждого ИмяСтрокой из МассивДанных Цикл
			Для каждого стр из ПараметрыСценария Цикл
				Если нрег(ИмяСтрокой)=нрег(стр.Имя) Тогда
					СтруктураДанных.Вставить(ИмяСтрокой,стр.Значение);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Если Type="TemporaryJSON" ИЛИ Type="CatalogJSON" Тогда
			ЗаписатьПараметрыВФайлJSON(ПутьКФайлу,СтруктураДанных);	
		ИначеЕсли Type="1CBase" Тогда
			ЗаписатьПараметрыВБазу(ПутьКФайлу,СтруктураДанных);
		КонецЕсли;
	ИначеЕсли ИмяКоманды="вспомнить" Тогда
		Если Type="TemporaryJSON" ИЛИ Type="CatalogJSON" Тогда
			СтруктураДанных = ПрочитатьПараметрыИзФайлаJSON(ПутьКФайлу,ИмяПараметра);
		ИначеЕсли Type="1CBase" Тогда
			СтруктураДанных = ПрочитатьПараметрыИзБазы(ПутьКФайлу,ИмяПараметра);
		КонецЕсли;
		
		//сохраним в параметрах
		Для каждого  элемент из СтруктураДанных Цикл
			Для каждого стр из ПараметрыСценария Цикл
				Если нрег(элемент.Ключ)=нрег(стр.Имя) Тогда
					стр.Значение = Элемент.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	ИначеЕсли ИмяКоманды="забыть" Тогда
		Если Type="TemporaryJSON" ИЛИ Type="CatalogJSON" Тогда
		ИначеЕсли Type="1CBase" Тогда
			УдалитьПараметрыИзБазы(ПутьКФайлу,ИмяПараметра);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


#Область СохранениеЗагрузкаФайл

&НаКлиенте
Функция ПрочитатьПараметрыИзФайлаJSON(Знач ПутьКФайлу, Знач ПараметрыСтрокой) Экспорт
	
	ЗагрузитьБиблиотеки();
	
	СоответствиеДанных = новый Соответствие;
	МассивПараметров = СтрРазделить(ПараметрыСтрокой,",;:/\",Ложь);
	Если МассивПараметров.Количество()=0 Тогда
		ВызватьИсключение "Имя параметров пустое или некорректное!";
	КонецЕсли;
	
	ТекстДок = новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ПутьКФайлу,КодировкаТекста.UTF8);
	ДанныеСтрокой = ТекстДок.ПолучитьТекст();
	ТекстДок  =Неопределено;
	
	СтруктураДанных = Модуль_СервисныеФункции.ОбработкаJSON(ДанныеСтрокой);
	
	Возврат СтруктураДанных;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьПараметрыВФайлJSON(Знач ПутьКФайлу, Знач СтруктураДанных) Экспорт
	
	ЗагрузитьБиблиотеки();
	
	// 1. Загрузим что в файле
	МассивСтрок = новый Массив;
	Для каждого стр из СтруктураДанных Цикл
		МассивСтрок.Добавить(стр.Ключ);
	КонецЦикла;
	ПараметрыСтрокой = СтрСоединить(МассивСтрок,",");
	
	Файл = новый Файл(ПутьКФайлу);
	Если Файл.Существует() Тогда
		ПолнаяСтруктураДанных = ПрочитатьПараметрыИзФайлаJSON(ПутьКФайлу,ПараметрыСтрокой);
	
		// 2. Дополним значениями
		Для каждого стр из СтруктураДанных Цикл
			ПолнаяСтруктураДанных.Вставить(стр.Ключ,стр.Значение);
		КонецЦикла;
	Иначе
		ПолнаяСтруктураДанных = СтруктураДанных;
	КонецЕсли;
	
	// 3. Сохраним
	Строка = Модуль_СервисныеФункции.ДанныеВJSONСтроку(ПолнаяСтруктураДанных);
	ТекстДок = новый ТекстовыйДокумент;
	ТекстДок.УстановитьТекст(Строка);
	ТекстДок.Записать(ПутьКФайлу,КодировкаТекста.UTF8);
	ТекстДок = Неопределено;	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПараметрыИзФайлаJSON(Знач ПутьКФайлу, Знач ПараметрыСтрокой) Экспорт
	
	ЗагрузитьБиблиотеки();
	
	СоответствиеДанных = новый Соответствие;
	МассивПараметров = СтрРазделить(ПараметрыСтрокой,",;:/\",Ложь);
	Если МассивПараметров.Количество()=0 Тогда
		ВызватьИсключение "Имя параметров пустое или некорректное!";
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#Область СохранениеЗагрузкаПамятьБазы

&НаКлиенте
Функция ПрочитатьПараметрыИзБазы(Знач Ключ, Знач ПараметрыСтрокой) Экспорт
	
	СоответствиеДанных = новый Соответствие;
	МассивПараметров = СтрРазделить(ПараметрыСтрокой,",;:/\",Ложь);
	Если МассивПараметров.Количество()=0 Тогда
		ВызватьИсключение "Имя параметров пустое или некорректное!";
	КонецЕсли;
	
	Для каждого стр из МассивПараметров Цикл
		ИмяПараметра = СокрЛП(стр);		
		ЗначениеПараметра = ПланировщикЗаданийВызовСервера.ПолучитьЗначениеПользовательскойПеременной(Неопределено,ИмяПараметра,Ключ);
		Если ЗначениеПараметра=Неопределено Тогда
			ВызватьИсключение "Значение параметра '"+ИмяПараметра+"' отсутсвует в базе!";
		КонецЕсли;
		СоответствиеДанных.Вставить(ИмяПараметра,ЗначениеПараметра);
	КонецЦикла;	
	
	Возврат СоответствиеДанных;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьПараметрыВБазу(Знач Ключ, Знач СоответсвиеДанных) Экспорт
	
	Для каждого стр из СоответсвиеДанных Цикл
		
		ИмяПараметра = стр.Ключ;
		ЗначениеПараметра = стр.Значение;
		
		ПланировщикЗаданийВызовСервера.УстановитьЗначениеПользовательскойПеременной(Неопределено,ИмяПараметра,ЗначениеПараметра,Ключ);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПараметрыИзБазы(Знач Ключ, Знач ПараметрыСтрокой) Экспорт
	
	МассивПараметров = СтрРазделить(ПараметрыСтрокой,",;:/\",Ложь);
	Если МассивПараметров.Количество()=0 Тогда
		ВызватьИсключение "Имя параметров пустое или некорректное!";
	КонецЕсли;
	
	Для каждого стр из МассивПараметров Цикл
		ИмяПараметра = СокрЛП(стр);		
		ПланировщикЗаданийВызовСервера.УдалитьЗначениеПользовательскойПеременной(Неопределено,ИмяПараметра,Ключ);
	КонецЦикла;	
	
КонецПроцедуры


#КонецОбласти

#Область Вспомогательные

&НаКлиенте
Процедура ЗагрузитьБиблиотеки()
	
	Если Модуль_СервисныеФункции=Неопределено Тогда
		Модуль_СервисныеФункции = ПолучитьФорму("ВнешняяОбработка.МенеджерСценарногоТеста.Форма.Модуль_СервисныеФункции");
	КонецЕсли;		
	
КонецПроцедуры

#КонецОбласти