
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтображениеДоступностьКлиента1С();
	
КонецПроцедуры


&НаКлиенте
Процедура ЭтоКлиент1СПриИзменении(Элемент)
	УстановитьОтображениеДоступностьКлиента1С();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтображениеДоступностьКлиента1С()
	
	Элементы.База1С.Видимость = Объект.ЭтоКлиент1С;
	
КонецПроцедуры


&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.ID) Тогда
		Объект.ID = СценарноеТестированиеКлиентСервер.СформироватьАвтоматическиИдентификаторТеста(Объект.Наименование);
	КонецЕсли;
КонецПроцедуры

