
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.ID) Тогда
		Объект.ID = СценарноеТестированиеКлиентСервер.СформироватьАвтоматическиИдентификаторТеста(Объект.Наименование);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогДляОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.Заголовок = "Выберите каталог обмена"; 
	Если ЗначениеЗаполнено(Объект.КаталогДляОбмена) Тогда
		Диалог.Каталог = Объект.КаталогДляОбмена;
	КонецЕсли;
	Диалог.ПолноеИмяФайла = ""; 
	Диалог.МножественныйВыбор = Ложь; 
	ВыборФайлаОткрытияКаталога = новый ОписаниеОповещения("ВыборФайлаОткрытияКаталога",ЭтотОбъект,Новый Структура("ИмяКаталога","КаталогДляОбмена"));
	Диалог.Показать(ВыборФайлаОткрытияКаталога);

КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаОткрытияКаталога(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		ИмяКаталога = "";
		Если ДополнительныеПараметры.Свойство("ИмяКаталога",ИмяКаталога) Тогда
			Объект[ИмяКаталога] = ВыбранныеФайлы[0]; 
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры
