#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ПередЗаписью(Отказ, Замещение)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры

#КонецЕсли
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// проставим недостающие данные
	Для каждого стр из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(стр.ИдентификаторКомнаты) Тогда
			стр.ИдентификаторКомнаты = Строка(Новый UUID());	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
