
Функция RegistrationGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция RegistrationPOST(Запрос)
	
	data = ДанныеИзJSONСтроки(Запрос.ПолучитьТелоКакСтроку());
	outdata = ОбщийЧатСервер.ЗарегистрироватьсяВОбщийЧат1С(data.ИмяВхода,data.НомерПорта,data.ТочкаВхода,data.ИдентификаторУчастника,data.PID);

	Ответ = СоздатьОтвет(200,"",ДанныеВJSONСтроку(outdata));	
	
	Возврат Ответ;
КонецФункции

Функция LogoutGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция LogoutPOST(Запрос)
	
	data = ДанныеИзJSONСтроки(Запрос.ПолучитьТелоКакСтроку());
	ОбщийЧатСервер.ОбновитьИнформациюСтатусУчастникаЧата(data.СтруктураЗаписи,data.Режим);

	Ответ = СоздатьОтвет(200,"","");	
	
	Возврат Ответ;
КонецФункции

Функция LoginGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция LoginPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция SendMessageGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция SendMessagePOST(Запрос)
	
	data = ДанныеИзJSONСтроки(Запрос.ПолучитьТелоКакСтроку());
	ОбщийЧатСервер.ОтправитьСообщениеВЧат(data);

	Ответ = СоздатьОтвет(200,"","");	
	
	Возврат Ответ;
КонецФункции

Функция GetMessagesGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция GetMessagesPOST(Запрос)
	
	data = ДанныеИзJSONСтроки(Запрос.ПолучитьТелоКакСтроку());
	СтруктураОтвета = ОбщийЧатСервер.ПолучитьСообщенияЧата(data.ИдентификаторКомнаты,data.ИдентификаторОтправителя,data.ИдентификаторПолучателя,data.ГлубинаЧата,data.ГлубинаЧатаСообщений);

	Ответ = СоздатьОтвет(200,"",ДанныеВJSONСтроку(СтруктураОтвета));	
	
	Возврат Ответ;
КонецФункции

Функция GetNewMessagesPOST(Запрос)
	
	data = ДанныеИзJSONСтроки(Запрос.ПолучитьТелоКакСтроку());
	СтруктураОтвета = ОбщийЧатСервер.ПолучитьНовыеСообщения(data.ИдентификаторУчастника);

	Ответ = СоздатьОтвет(200,"",ДанныеВJSONСтроку(СтруктураОтвета));	
	
	Возврат Ответ;
КонецФункции

Функция GetMessagePropertyPOST(Запрос)
	
	СтруктураОтвета = ОбщийЧатКлиентСервер.ПолучитьСтруктуруСообщенияЧата();

	Ответ = СоздатьОтвет(200,"",ДанныеВJSONСтроку(СтруктураОтвета));	
	
	Возврат Ответ;
КонецФункции

Функция GetUsersPOST(Запрос)

	СтруктураОтвета = ОбщийЧатСервер.ПолучитьТаблицуУчастниковЧата();

	Ответ = СоздатьОтвет(200,"",ДанныеВJSONСтроку(СтруктураОтвета));		
	
	Возврат Ответ;
КонецФункции

Функция EnterToRoomPOST(Запрос)
	data = ДанныеИзJSONСтроки(Запрос.ПолучитьТелоКакСтроку());
	Если НЕ ЗначениеЗаполнено(data.ИгроваяКомната) Тогда
		Ответ = СоздатьОтвет(400,"","Игровая комната пустая");	
	Иначе
		СтруктураОтвета = ОбщийЧатСервер.ЗайтиВИгровуюКомнату(data.ИдентификаторУчастника,data.ИгроваяКомната);
		Ответ = СоздатьОтвет(200,"",ДанныеВJSONСтроку(СтруктураОтвета));	
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

Функция ExitFromAllRoomsPOST(Запрос)
	data = ДанныеИзJSONСтроки(Запрос.ПолучитьТелоКакСтроку());
	СтруктураОтвета = ОбщийЧатСервер.ВыйтиИзВсехИгровыхКомнат(data.ИдентификаторУчастника);

	Ответ = СоздатьОтвет(200,"",ДанныеВJSONСтроку(СтруктураОтвета));	
	
	Возврат Ответ;
КонецФункции

Функция UpdateUserActivityPOST(Запрос)

	data = ДанныеИзJSONСтроки(Запрос.ПолучитьТелоКакСтроку());
	//++ Масленников
	//ошибка - обращение к процедуре как к функции
 	//СтруктураОтвета = ОбщийЧатСервер.ОбновитьДатуАктивностиСтатусаУчастника(data.ИдентификаторУчастника);
 	ОбщийЧатСервер.ОбновитьДатуАктивностиСтатусаУчастника(data.ИдентификаторУчастника);

	//++ Масленников
	//Ответ = СоздатьОтвет(200,"",ДанныеВJSONСтроку(СтруктураОтвета));		
	Ответ = СоздатьОтвет(200,"",ДанныеВJSONСтроку(""));		
	
	Возврат Ответ;
КонецФункции

Функция GetUsersStatesPOST(Запрос)
	
	data = ДанныеИзJSONСтроки(Запрос.ПолучитьТелоКакСтроку());
	СтруктураОтвета = ОбщийЧатСервер.ПолучитьСостоянияУчастников(data);

	Ответ = СоздатьОтвет(200,"",ДанныеВJSONСтроку(СтруктураОтвета));		
	
	Возврат Ответ;

КонецФункции


Функция SetMeasurementPOST(Запрос)
	
	data = ДанныеИзJSONСтроки(Запрос.ПолучитьТелоКакСтроку());
	
	ТекстОшибки = ЗамерыСервер.УстановитьНовыйЗамер(data);
	
	Если НЕ ЗначениеЗаполнено(ТекстОшибки) Тогда
		ТекстОшибки = "Success";
	КонецЕсли;
	Ответ = СоздатьОтвет(200,"",ТекстОшибки);
	
	Возврат Ответ;
КонецФункции

Функция GetMeasurementPOST(Запрос)
	
	data = ДанныеИзJSONСтроки(Запрос.ПолучитьТелоКакСтроку(),"StartDate,EndDate");
	
	СтруктураОтвета = ЗамерыСервер.ПолучитьДанныеЗамеров(data);

	Ответ = СоздатьОтвет(200,"",ДанныеВJSONСтроку(СтруктураОтвета));
	
	Возврат Ответ;
КонецФункции


#область РаботаСДанными

Функция ДанныеВJSONСтроку(Знач Данные) Экспорт
	
	ПараметерыЗаписи = Новый ПараметрыЗаписиJSON(,,,ЭкранированиеСимволовJSON.СимволыВнеASCII,Истина,Истина);
	НастройкиСериализации = Новый НастройкиСериализацииJSON();
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку( ПараметерыЗаписи );
	Попытка
		ЗаписатьJSON( ЗаписьJSON, Данные, НастройкиСериализации );
	Исключение
		ЗаписьЖурналаРегистрации("Reports.ДанныеВJSONСтроку",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
	Конецпопытки;
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ДанныеИзJSONСтроки( Строка , Знач ИменаСвойствСоЗначениямиДата = "") Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку( Строка );
	Данные = ПрочитатьJSON( ЧтениеJSON ,, ИменаСвойствСоЗначениямиДата );
	ЧтениеJSON.Закрыть();
	
	Возврат Данные;
	
КонецФункции

Функция СоздатьОтвет( КодСостояния = 200, ТекстСостояния = "", Сообщение = "", ЭтоДвоичныеДанные = Ложь) Экспорт
	
	Заголовки = Новый Соответствие();	
	Если ЭтоДвоичныеДанные Тогда // Виссаров ES-2749 [20.09.2017] ++
		Заголовки.Вставить("Content-Type", "text/plain;charset=utf-8");
	Иначе		
		Если КодСостояния >= 400 И КодСостояния <= 500 Тогда
			Заголовки.Вставить("Content-Type", "text/plain;charset=utf-8");
		Иначе
			Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
		КонецЕсли;
	КонецЕсли;
	
	Заголовки.Вставить("Cache-Control", "no-cache, no-store, private"); 	
	Ответ = Новый HTTPСервисОтвет(КодСостояния, ТекстСостояния, Заголовки );
	
	Если Не ПустаяСтрока(Сообщение) Тогда
		Если ЭтоДвоичныеДанные Тогда // Виссаров ES-2749 [20.09.2017] ++
			Ответ.УстановитьТелоИзДвоичныхДанных(Сообщение);
		Иначе
			Ответ.УстановитьТелоИзСтроки( Сообщение );
		КонецЕсли;   
	КонецЕсли;
	Если КодСостояния >= 300 Тогда
		Ответ.УстановитьТелоИзСтроки( ТекстСостояния );
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции 



#конецОбласти
