
Функция УстановитьНовыйЗамер(data) Экспорт
	
	ТекстОшибки = "";
	
	Попытка
		Для каждого стр из data Цикл
			
			МенеджерЗаписи = РегистрыСведений.ЗамерыВремени.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Ключ = стр.Key;
			МенеджерЗаписи.ДатаСобытия = стр.Date;
			МенеджерЗаписи.Длительность = стр.Duration;
			Если стр.Свойство("Id") Тогда 
				МенеджерЗаписи.Идентификатор = стр.Id;
			Иначе
				МенеджерЗаписи.Идентификатор = Строка(Новый UUID());
			КонецЕсли;
			МенеджерЗаписи.ДатаЗаписиУнив = ТекущаяУниверсальнаяДатаВМиллисекундах();
			МенеджерЗаписи.Записать(Истина);
			
		КонецЦикла;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	
	Возврат ТекстОшибки;
КонецФункции


Функция ПолучитьДанныеЗамеров(data) Экспорт
	                              
	СтруктураОтвета = Новый Массив;
	                               
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1000
	|	ЗамерыВремени.Ключ КАК Ключ,   
	|	ЗамерыВремени.Идентификатор КАК Идентификатор,
	|	ЗамерыВремени.Длительность КАК Длительность,
	|	ЗамерыВремени.ДатаЗаписиУнив КАК ДатаЗаписиУнив,
	|	ЗамерыВремени.ДатаСобытия КАК ДатаСобытия
	|ИЗ
	|	РегистрСведений.ЗамерыВремени КАК ЗамерыВремени
	|ГДЕ
	|	ЗамерыВремени.ДатаСобытия МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗамерыВремени.ДатаЗаписиУнив";
	
	Запрос.УстановитьПараметр("ДатаНачала",data.StartDate);
	Запрос.УстановитьПараметр("ДатаОкончания",data.EndDate);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураЗаписи = Новый Структура();
		СтруктураЗаписи.Вставить("Key",Выборка.Ключ);
		СтруктураЗаписи.Вставить("Id",Выборка.Идентификатор);
		СтруктураЗаписи.Вставить("DateWrite",Выборка.ДатаЗаписиУнив);
		СтруктураЗаписи.Вставить("Date",Выборка.ДатаСобытия);
		СтруктураЗаписи.Вставить("Duration",Выборка.Длительность);
		
		СтруктураОтвета.Добавить(СтруктураЗаписи);
		
	КонецЦикла;
	
	Возврат СтруктураОтвета;
	
КонецФункции