
Функция НайтиТестируемыйКлиентПоID(Знач ID) Экспорт
	
	ТестируемыйКлиент = Справочники.ТестируемыеКлиенты.ПустаяСсылка();
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТестируемыеКлиенты.Ссылка
	|ИЗ
	|	Справочник.ТестируемыеКлиенты КАК ТестируемыеКлиенты
	|ГДЕ
	|	ТестируемыеКлиенты.ID = &ID";
	Запрос.УстановитьПараметр("ID",ID);

	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			ТестируемыйКлиент = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТестируемыйКлиент;
	
КонецФункции
	