
Процедура УстановитьПрефиксКонфигурацииПриУстановкеНовогоКода(Источник, СтандартнаяОбработка, Префикс) Экспорт
	УстановитьПрефикс(Источник, Префикс);
КонецПроцедуры

Процедура УстановитьПрефикс(Источник, Префикс)
	
	ПрефиксКонфигурации = "00";
	
		
	Если РеквизитДоступен(Источник,"Конфигурация") Тогда
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Конфигурации.Префикс как Префикс 
		|ИЗ
		|	Справочник.Конфигурации КАК Конфигурации
		|ГДЕ
		|	Конфигурации.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",Источник["Конфигурация"]);
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Если Выборка.Следующий() Тогда
				ПрефиксКонфигурации = Выборка.Префикс;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
		
	
	ШаблонПрефикса = "[КО]-[Префикс]";
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[КО]", ПрефиксКонфигурации);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[Префикс]", Префикс);
	
	Префикс = ШаблонПрефикса;
	
КонецПроцедуры


Функция РеквизитДоступен(Объект,ИмяРеквизита)
	
	// Возвращаемое значение функции.
	Результат = Истина;
	
	МетаданныеОбъекта = Объект.Метаданные();
	
	Если   (ОбщегоНазначения.ЭтоСправочник(МетаданныеОбъекта)
		ИЛИ ОбщегоНазначения.ЭтоПланВидовХарактеристик(МетаданныеОбъекта))
		И МетаданныеОбъекта.Иерархический Тогда
		
	
		Реквизит = МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита);
		
		Если Реквизит = Неопределено Тогда
			
			Если ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеОбъекта.СтандартныеРеквизиты, ИмяРеквизита) Тогда
				
				// Стандартный реквизит всегда доступен и для элемента и для группы.
				Возврат Истина;
				
			КонецЕсли;
			
			СтрокаСообщения = НСтр("ru = 'Для объекта метаданных %1 не определен реквизит с именем %2.'");
			//СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, МетаданныеОбъекта.ПолноеИмя(), ИмяРеквизитаОрганизация);
			ВызватьИсключение СтрокаСообщения;
		КонецЕсли;
			
		Если Реквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы И Не Объект.ЭтоГруппа Тогда
			
			Результат = Ложь;
			
		ИначеЕсли Реквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента И Объект.ЭтоГруппа Тогда
			
			Результат = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
