#Область Сообщения

Функция ПолучитьСтруктуруСообщенияЧата() Экспорт
	
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("ЭтоОтвет",Ложь);
	СтруктураДанных.Вставить("Комната","");
	СтруктураДанных.Вставить("ИдентификаторКомнаты","");
	СтруктураДанных.Вставить("Отправитель","");
	СтруктураДанных.Вставить("ИдентификаторОтправителя","");
	СтруктураДанных.Вставить("Получатель","");
	СтруктураДанных.Вставить("ИдентификаторПолучателя","");
	СтруктураДанных.Вставить("Сообщение","");
	СтруктураДанных.Вставить("ИдентификаторСообщения","");
	СтруктураДанных.Вставить("Отправлено",Ложь);
	СтруктураДанных.Вставить("ДатаСообщенияУнив",0);
	СтруктураДанных.Вставить("ДатаСообщения","");
	
	Возврат СтруктураДанных;
КонецФункции

#КонецОбласти