
Функция ЗагрузитьОтчетВыполненияСценарногоТестированияФорматJUnitXML(ПутьКФайлуОтчета,Сообщение="") Экспорт
	
	Возврат Ложь;
	
КонецФункции

Функция СформироватьАвтоматическиИдентификаторТеста(Знач Наименование) Экспорт
	Ключ = Наименование;
	Ключ = СтрЗаменить(Ключ," ","_");
	Ключ = СтрЗаменить(Ключ,")","");
	Ключ = СтрЗаменить(Ключ,"(","");
	Ключ = СтрЗаменить(Ключ,"/","_");
	Ключ = СтрЗаменить(Ключ,"\","_");
	Ключ = СтрЗаменить(Ключ,"'","_");
	Ключ = СтрЗаменить(Ключ,"""","_");
	Ключ = СтрЗаменить(Ключ,".","_");
	Ключ = СтрЗаменить(Ключ,",","_");
	Ключ = СтрЗаменить(Ключ,"?","");
	Ключ = СтрЗаменить(Ключ,"!","");
	Ключ = СтрЗаменить(Ключ,"*","");
	Ключ = СтрЗаменить(Ключ,"&","_");
	Ключ = СтрЗаменить(Ключ,"%","_");
	Ключ = СтрЗаменить(Ключ,"$","_");
	Ключ = УдалитьНедопустимыеСимволыXML(Ключ);
	Возврат Ключ;
КонецФункции

Функция УдалитьНедопустимыеСимволыXML(Знач Результат) Экспорт
	Позиция = НайтиНедопустимыеСимволыXML(Результат);
	Пока Позиция > 0 Цикл
		Результат = Лев(Результат, Позиция - 1) + Сред(Результат, Позиция + 1);
		Позиция = НайтиНедопустимыеСимволыXML(Результат, Позиция);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции