#Область  РаботаСПеременными

Функция УдалитьЗначениеПеременной(Знач Задание,Знач ИмяПеременной) Экспорт
	Возврат ПланировщикЗаданийСервер.УдалитьЗначениеПеременной(Задание,ИмяПеременной);
КонецФункции	

Функция УстановитьЗначениеПеременной(Знач Задание,Знач ИмяПеременной,Знач ЗначениеПеременной,Знач Ключ=Неопределено) Экспорт
	Возврат ПланировщикЗаданийСервер.УстановитьЗначениеПеременной(Задание,ИмяПеременной,ЗначениеПеременной,Ключ);
КонецФункции	
	
Функция ПолучитьЗначениеПеременной(Знач Задание,Знач ИмяПеременной,Знач Ключ=Неопределено) Экспорт
	Возврат ПланировщикЗаданийСервер.ПолучитьЗначениеПеременной(Задание,ИмяПеременной,Ключ);
КонецФункции

Функция ПолучитьЗначениеПользовательскойПеременной(Знач Задание,Знач ИмяПеременной,Знач Ключ=Неопределено) Экспорт
	Возврат ПланировщикЗаданийСервер.ПолучитьЗначениеПользовательскойПеременной(Задание,ИмяПеременной,Ключ);
КонецФункции

Функция УстановитьЗначениеПользовательскойПеременной(Знач Задание,Знач ИмяПеременной,Знач ЗначениеПеременной,Знач Ключ=Неопределено) Экспорт
	Возврат ПланировщикЗаданийСервер.УстановитьЗначениеПользовательскойПеременной(Задание,ИмяПеременной,ЗначениеПеременной,Ключ);
КонецФункции

Функция УдалитьЗначениеПользовательскойПеременной(Знач Задание,Знач ИмяПеременной) Экспорт
	Возврат ПланировщикЗаданийСервер.УдалитьЗначениеПользовательскойПеременной(Задание,ИмяПеременной);
КонецФункции	

#КонецОбласти