&НаКлиенте
Перем Модуль_СервисныеФункции;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отказ = Истина; // форма не предназначена для открытия
КонецПроцедуры

#Область Команды

&НаКлиенте
Процедура мСценСкрипт_GenerateClientConnection(ТестовоеПриложение,ОписаниеОшибки,Знач СвойстваПодключенияКлиентаТестирования,ПараметрыСценария,Знач НомерПорта,Знач Интервал=0) Экспорт
	
	ЗагрузитьБиблиотеки();

	// проверим связь, активна ли сессия?
	Если ЗначениеЗаполнено(ТестовоеПриложение) Тогда

		СтрокаКоманды = "&Operation=status_session&answer_format=json";
		СтруктураОтвета = Неопределено;

		СтруктураОтвета = Модуль_СервисныеФункции.ЗагрузитьФайлПоИнтернетАдресу("http://localhost:8080/rest.html?"
			+ СтрокаКоманды);

		Если СтруктураОтвета.КодСостояния = 200 Тогда

			ТекстовыйДокумент = новый ТекстовыйДокумент();
			ТекстовыйДокумент.Прочитать(СтруктураОтвета.ПутьКФайлу, "UTF-8");
			Текст = ТекстовыйДокумент.ПолучитьТекст();
			
			РезультатПреобразования = Модуль_СервисныеФункции.ОбработкаJSON(Текст);
			
			Если РезультатПреобразования.status = "false" тогда
				ТестовоеПриложение = Неопределено;
			Иначе
				Возврат;
			КонецЕсли;
		Иначе 
			ОписаниеОшибки = "Не удалось получить данные" ;
			ТестовоеПриложение = Неопределено;
		КонецЕсли;		
		
	КонецЕсли;
	
	Если ТестовоеПриложение=Неопределено или ТестовоеПриложение="" Тогда

			// подключимся к тестируемому приложению
		// и получим хеш
		СтрокаКоманды = "&Operation=new_session&answer_format=json";
		СтруктураОтвета = Неопределено;

		СтруктураОтвета = Модуль_СервисныеФункции.ЗагрузитьФайлПоИнтернетАдресу("http://localhost:8080/rest.html?"
			+ СтрокаКоманды);

		Если НЕ СтруктураОтвета.КодСостояния = 200 Тогда
			ОписаниеОшибки = "Не удалось получить данные";
		КонецЕсли;

		ТекстовыйДокумент = новый ТекстовыйДокумент();
		ТекстовыйДокумент.Прочитать(СтруктураОтвета.ПутьКФайлу, "UTF-8");
		Текст = ТекстовыйДокумент.ПолучитьТекст();

		РезультатПреобразования = Модуль_СервисныеФункции.ОбработкаJSON(Текст);
		
		ТестовоеПриложение = РезультатПреобразования.session_id;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура мСценСкрипт_GenerateClientDisconnection(ТестовоеПриложение,ОписаниеОшибки,СвойстваПодключенияКлиентаТестирования) Экспорт	


	// подключимся к тестируемому приложению
	СтрокаКоманды = "&Operation=delete_step&answer_format=json&session_id="+ТестовоеПриложение; 
	СтруктураОтвета = Неопределено;

	СтруктураОтвета = Модуль_СервисныеФункции.ЗагрузитьФайлПоИнтернетАдресу("http://localhost:8080/rest.html?"+СтрокаКоманды);

	Если НЕ СтруктураОтвета.КодСостояния=200 Тогда
		ОписаниеОшибки =  "Не удалось получить данные";
	КонецЕсли;
	
	ТекстовыйДокумент = новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(СтруктураОтвета.ПутьКФайлу,"UTF-8");
	Текст = ТекстовыйДокумент.ПолучитьТекст();
	
	//РезультатПреобразования = Модуль_СервисныеФункции.ОбработкаJSON(Текст);
	
	//ТестовоеПриложение = Текст; // guid сессии	

	
КонецПроцедуры

&НаКлиенте
Процедура мСценСкрипт_НайтиОсновноеОкно(ТестовоеПриложение,ОписаниеОшибки,ТекущаяПеременная) Экспорт
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура мСценСкрипт_НайтиОкно(ТестовоеПриложение,ОписаниеОшибки,ТекущаяПеременная,Знач ЗаголовокОбъекта,ИспользоватьВариантыПоиска=Ложь) Экспорт


	// подключимся к тестируемому приложению
	СтрокаКоманды = "&Operation=play_step&answer_format=json&session_id="+ТестовоеПриложение;
	СтрокаКоманды = СтрокаКоманды + "&api=Automation UI";
	СтрокаКоманды = СтрокаКоманды + "&action=find window";
	СтрокаКоманды = СтрокаКоманды + "&element_name="+ЗаголовокОбъекта;
	
	 
	СтруктураОтвета = Неопределено;

	СтруктураОтвета = Модуль_СервисныеФункции.ЗагрузитьФайлПоИнтернетАдресу("http://localhost:8080/rest.html?"+СтрокаКоманды);

	Если НЕ СтруктураОтвета.КодСостояния=200 Тогда
		ОписаниеОшибки =  "Не удалось получить данные";
	КонецЕсли;
	
	ТекстовыйДокумент = новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(СтруктураОтвета.ПутьКФайлу,"UTF-8");
	Текст = ТекстовыйДокумент.ПолучитьТекст();
	
	РезультатПреобразования = Модуль_СервисныеФункции.ОбработкаJSON(Текст);
	
	Если НРег(РезультатПреобразования.error)="true" Тогда
		ОписаниеОшибки = РезультатПреобразования.message;
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура мСценСкрипт_НайтиОбъект(ТестовоеПриложение,ОписаниеОшибки,Знач ТипОбъекта,ТекущаяПеременная,РодительПеременная,Знач ЗаголовокОбъекта,Знач ИмяОбъекта, Знач ИмяКлассаОбъекта, ИспользоватьВариантыПоиска=Ложь) Экспорт
	
	СтрокаКоманды = "&Operation=play_step&answer_format=json&session_id="+ТестовоеПриложение;
	СтрокаКоманды = СтрокаКоманды + "&api=Automation UI";
	СтрокаКоманды = СтрокаКоманды + "&action=find element";
	СтрокаКоманды = СтрокаКоманды + "&element_name="+ЗаголовокОбъекта;
	СтрокаКоманды = СтрокаКоманды + "&element_class_name="+ИмяКлассаОбъекта;
	СтрокаКоманды = СтрокаКоманды + "&element_type="+ТипОбъекта;	
	 
	СтруктураОтвета = Неопределено;

	СтруктураОтвета = Модуль_СервисныеФункции.ЗагрузитьФайлПоИнтернетАдресу("http://localhost:8080/rest.html?"+СтрокаКоманды);

	Если НЕ СтруктураОтвета.КодСостояния=200 Тогда
		ОписаниеОшибки =  "Не удалось получить данные";
	КонецЕсли;
	
	ТекстовыйДокумент = новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(СтруктураОтвета.ПутьКФайлу,"UTF-8");
	Текст = ТекстовыйДокумент.ПолучитьТекст();
	
	РезультатПреобразования = Модуль_СервисныеФункции.ОбработкаJSON(Текст);
	
	Если НРег(РезультатПреобразования.error)="true" Тогда
		ОписаниеОшибки = РезультатПреобразования.message;
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура мСценСкрипт_ВыполнитьКоманду(ТестовоеПриложение,ОписаниеОшибки,ИмяКоманды,ТипОбъекта,ТекущаяПеременная,РодительПеременная,ЗаголовокОбъекта,OutputText,CommandRef,Presentation,Direction,RowDescription,SwitchSelection,Cancel,Area,ИмяПараметра,ЗначениеПараметра,ПараметрыСценария) Экспорт
	
	СтрокаКоманды = "&Operation=play_step&answer_format=json&session_id="+ТестовоеПриложение;
	СтрокаКоманды = СтрокаКоманды + "&api=Automation UI";
	СтрокаКоманды = СтрокаКоманды + "&action=command";
	СтрокаКоманды = СтрокаКоманды + "&command="+ИмяКоманды;
	 
	СтруктураОтвета = Неопределено;

	СтруктураОтвета = Модуль_СервисныеФункции.ЗагрузитьФайлПоИнтернетАдресу("http://localhost:8080/rest.html?"+СтрокаКоманды);

	Если НЕ СтруктураОтвета.КодСостояния=200 Тогда
		ОписаниеОшибки =  "Не удалось получить данные";
	КонецЕсли;
	
	ТекстовыйДокумент = новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(СтруктураОтвета.ПутьКФайлу,"UTF-8");
	Текст = ТекстовыйДокумент.ПолучитьТекст();
	
	РезультатПреобразования = Модуль_СервисныеФункции.ОбработкаJSON(Текст);
	
	Если НРег(РезультатПреобразования.error)="true" Тогда
		ОписаниеОшибки = РезультатПреобразования.message;
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗагрузитьБиблиотеки()
	
	Если Модуль_СервисныеФункции=Неопределено Тогда
		Модуль_СервисныеФункции = ПолучитьФорму("ВнешняяОбработка.МенеджерСценарногоТеста.Форма.Модуль_СервисныеФункции");
	КонецЕсли;		
	
КонецПроцедуры	