
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.Комментарий) Тогда
		Элементы.СтраницаКомментарий.Картинка = БиблиотекаКартинок.Карандаш_16х16;
	КонецЕсли;
	
	Элементы.Интервал.Доступность = НЕ Запись.Однократно;

КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Запись.Комментарий) Тогда
		Элементы.СтраницаКомментарий.Картинка = БиблиотекаКартинок.Карандаш_16х16;
	Иначе
		Элементы.СтраницаКомментарий.Картинка = новый Картинка;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОднократноПриИзменении(Элемент)
	Элементы.Интервал.Доступность = НЕ Запись.Однократно;
КонецПроцедуры
