
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры


&НаСервере
Процедура ВыполнитьСейчасСервер(Задание)
	ОписаниеОшибки = "";
	Если ПланировщикЗаданийСервер.ДобавитьЗаданиеВПуллНемедленно(Задание,ОписаниеОшибки)=Истина Тогда
		Сообщить("Успешно!");
	Иначе
		Сообщить("Ошибка!"+Символы.ПС+ОписаниеОшибки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСейчас(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВыполнитьСейчасСервер(ТекущиеДанные.Задание);
КонецПроцедуры

&НаСервере
Процедура ИзменитьАктивностьЗадания(Знач Ключ,Знач Активность)
	
	МенеджерЗаписи = РегистрыСведений.Планировщик.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Задание 			= Ключ.Задание;
	МенеджерЗаписи.ВремяНачала 		= Ключ.ВремяНачала;
	МенеджерЗаписи.ВремяОкончания 	= Ключ.ВремяОкончания;
	МенеджерЗаписи.Интервал 		= Ключ.Интервал;
	
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Включено = Активность;
	
	МенеджерЗаписи.Записать(Истина);	

КонецПроцедуры

&НаКлиенте
Процедура ПереключитьАктивность(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ключ = новый Структура("Задание,ВремяНачала,ВремяОкончания,Интервал");
	ЗаполнитьЗначенияСвойств(Ключ,ТекущиеДанные);
	ИзменитьАктивностьЗадания(Ключ,НЕ ТекущиеДанные.Включено);
	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтменитьВыполнениеНаСервере(Задание)
	ОписаниеОшибки = "";
	Если ПланировщикЗаданийСервер.УдалитьЗаданиеИзПуллаНемедленно(Задание,ОписаниеОшибки)=Истина Тогда
		Сообщить("Успешно!");
	Иначе
		Сообщить("Ошибка!"+Символы.ПС+ОписаниеОшибки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыполнение(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОтменитьВыполнениеНаСервере(ТекущиеДанные.Задание);
КонецПроцедуры
