
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если НЕ ЗначениеЗаполнено(Объект.ИдентификаторКонструктора) Тогда
	//	Элементы.ГруппаКонструктора.Видимость = Ложь;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИзменитьВидимостьШириныГорлышка();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.ID) Тогда
		Объект.ID = СценарноеТестированиеКлиентСервер.СформироватьАвтоматическиИдентификаторТеста(Объект.Наименование);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РежимРаботыПриИзменении(Элемент)
	ИзменитьВидимостьШириныГорлышка();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидимостьШириныГорлышка()
	Если Объект.РежимРаботы=ПредопределенноеЗначение("Перечисление.РежимыРаботыЗаданий.Воронка") Тогда
		Элементы.ШиринаГорлышка.Видимость = Истина;
	Иначе
		Элементы.ШиринаГорлышка.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры
 
